Lunerio/PAVApp/libraries/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_WM.h
      BLYNK_LOG4(BLYNK_F("con2WF:SSID="), Blynk8266_WF_config.wifi_ssid, BLYNK_F(",PW="), Blynk8266_WF_config.wifi_pw);
             
      while ( !wifi_connected && ( 0 < retry_time ) )
      {
#if ( BLYNK_WM_DEBUG > 2)        
        BLYNK_LOG2(BLYNK_F("Remaining retry_time="), retry_time);
#endif

#if USE_ESP32_AT
        // ESP32-AT requires restart everytime !!!
        wifi_connected = connectWiFi(Blynk8266_WF_config.wifi_ssid, Blynk8266_WF_config.wifi_pw);
#else
        if (firstTimeConnect)
        {
          wifi_connected = connectWiFi(Blynk8266_WF_config.wifi_ssid, Blynk8266_WF_config.wifi_pw);
        }
        else
        {
          wifi_connected = wifi->joinAP(Blynk8266_WF_config.wifi_ssid, Blynk8266_WF_config.wifi_pw);
        }
#endif
             
        // Need restart WiFi at beginning of each cycle 
        if (wifi_connected)
        {
          firstTimeConnect = false;
          
          break;
        }
        else
        {
          delay(sleep_time);
          retry_time--;
        }         
      }  

      if (wifi_connected)
      {
        BLYNK_LOG1(BLYNK_F("con2WF:OK"));
        displayWiFiData();
      }
      else
      {
        BLYNK_LOG1(BLYNK_F("con2WF:failed"));  
      }

      return wifi_connected;  
    }
    
    //////////////////////////////////////////////
    
    // Using PROGMEM to reduce memory usage in Mega (only terrible 8KBytes !!!)
    
    #define MAX_HTML_SIZE       2048      // 2K
       
    void createHTML(String& inString)
    {     
      char buffer[MAX_HTML_SIZE + 2];
      uint16_t offset = 0;
      uint16_t copyLen = MAX_HTML_SIZE > strlen_P(root_html_template) ? strlen_P(root_html_template) : MAX_HTML_SIZE;
       
      memset(buffer, 0, sizeof(buffer));
      
      for (uint16_t k = 0; k < copyLen; k++) 
      {
        buffer[offset++] = pgm_read_byte_near(root_html_template + k);     
      }
  
      inString = buffer;
      
      return;
    }
    
    //////////////////////////////////////////////

    void handleRequest()
    {
      if (server)
      {
        String key    = server->arg("key");
        String value  = server->arg("value");

        static int number_items_Updated = 0;

        if (key == "" && value == "")
        {
          String result = "";
          //result.reserve(MAX_HTML_SIZE + 2);
          createHTML(result);

          BLYNK_LOG1(BLYNK_F("h:repl"));

          // Reset configTimeout to stay here until finished.
          configTimeout = 0;
          
          if (hadConfigData)
          {
            result.replace("[[id]]",     Blynk8266_WF_config.wifi_ssid);
            result.replace("[[pw]]",     Blynk8266_WF_config.wifi_pw);
            result.replace("[[sv]]",     Blynk8266_WF_config.blynk_server);
            result.replace("[[tk]]",     Blynk8266_WF_config.blynk_token);
          }
          else
          {            
            // Better than garbage
            result.replace("[[id]]",  "");
            result.replace("[[pw]]",  "");
            result.replace("[[sv]]",  "blynk_server");
            result.replace("[[tk]]",  "blynk_token");
          }

          // Check if HTML size is larger than 2K, warn that WebServer won't work
          // because of notorious 2K buffer limitation of ESP8266-AT. 
          uint16_t HTML_page_size = result.length();
          
#if ( BLYNK_WM_DEBUG > 2)         
          BLYNK_LOG2(BLYNK_F("result = "), result);
          BLYNK_LOG2(BLYNK_F("h:HTML page size:"), HTML_page_size);
#endif
          
          if (HTML_page_size > MAX_HTML_SIZE)
          {
            BLYNK_LOG1(BLYNK_F("h:HTML page > 2048. CP not work. Reduce dynamic params"));
            BLYNK_LOG1(result);
          }   
          
          server->send(200, "text/html", result);
          
          return;
        }
        
        static bool id_Updated  = false;
        static bool pw_Updated  = false;
        static bool sv_Updated  = false;
        static bool tk_Updated  = false;

        if (number_items_Updated == 0)
        {
          memset(&Blynk8266_WF_config, 0, sizeof(Blynk8266_WF_config));
          strcpy(Blynk8266_WF_config.header, BLYNK_BOARD_TYPE);
        }

        if (!id_Updated && (key == String("id")))
        {
#if ( BLYNK_WM_DEBUG > 2)        
          BLYNK_LOG1(BLYNK_F("h:repl id"));
#endif        

          id_Updated = true;
          
          number_items_Updated++;
          if (strlen(value.c_str()) < sizeof(Blynk8266_WF_config.wifi_ssid) - 1)
            strcpy(Blynk8266_WF_config.wifi_ssid, value.c_str());
          else
            strncpy(Blynk8266_WF_config.wifi_ssid, value.c_str(), sizeof(Blynk8266_WF_config.wifi_ssid) - 1);
        }
        else if (!pw_Updated && (key == String("pw")))
        {
#if ( BLYNK_WM_DEBUG > 2)        
          BLYNK_LOG1(BLYNK_F("h:repl pw"));
#endif
          pw_Updated = true;
          
          number_items_Updated++;
          if (strlen(value.c_str()) < sizeof(Blynk8266_WF_config.wifi_pw) - 1)
            strcpy(Blynk8266_WF_config.wifi_pw, value.c_str());
          else
            strncpy(Blynk8266_WF_config.wifi_pw, value.c_str(), sizeof(Blynk8266_WF_config.wifi_pw) - 1);
        }
        else if (!sv_Updated && (key == String("sv")))
        {
#if ( BLYNK_WM_DEBUG > 2)        
          BLYNK_LOG1(BLYNK_F("h:repl sv"));
#endif
          sv_Updated = true;
          
          number_items_Updated++;
          if (strlen(value.c_str()) < sizeof(Blynk8266_WF_config.blynk_server) - 1)
            strcpy(Blynk8266_WF_config.blynk_server, value.c_str());
          else
            strncpy(Blynk8266_WF_config.blynk_server, value.c_str(), sizeof(Blynk8266_WF_config.blynk_server) - 1);
        }
        else if (!tk_Updated && (key == String("tk")))
        {
#if ( BLYNK_WM_DEBUG > 2)        
          BLYNK_LOG1(BLYNK_F("h:repl tk"));
#endif
          tk_Updated = true;
          
          number_items_Updated++;
          if (strlen(value.c_str()) < sizeof(Blynk8266_WF_config.blynk_token) - 1)
            strcpy(Blynk8266_WF_config.blynk_token, value.c_str());
          else
            strncpy(Blynk8266_WF_config.blynk_token, value.c_str(), sizeof(Blynk8266_WF_config.blynk_token) - 1);
        }
        
        BLYNK_LOG2(BLYNK_F("h:items updated ="), number_items_Updated);
        BLYNK_LOG4(BLYNK_F("h:key ="), key, BLYNK_F(", value ="), value);

